w6d3/FirstRoutes/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])

    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "melissa@melissa.com"], ["updated_at", "2021-02-25 00:44:55.208841"], ["id", 2]]