w7d2/music/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 12]]
---
  <ol >
    <% @album.tracks.each do |track| %>