w8d1/reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(params.require(:sub).permit(:title, :description))
    @sub.user_id = params[:user_id]
    if @sub.save == false
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["description", "testing 123"], ["user_id", 1], ["created_at", "2021-03-08 20:02:24.619353"], ["updated_at", "2021-03-08 20:02:24.619353"]]