w8d1/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(params.require(:user).permit(:username, :password))
    if @user.save == false

SELECT "subs".* FROM "subs" WHERE "subs"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @subs = Sub.all
    @user = User.find_by(id: params[:id])