w8d1/reddit_clone/app/views/users/show.html.erb

<ul>
<% current_user.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" WHERE "subs"."user_id" = $1  [["user_id", 1]]