w8d1/reddit_clone/app/models/user.rb

  def reset_session_token!
    token = SecureRandom.base64
    self.session_token = token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "bBoLJInwe/HTmOqRpps9Jw=="], ["updated_at", "2021-03-08 19:32:15.734667"], ["id", 1]]