w7d2/music/app/controllers/albums_controller.rb

  def create
    # new_params = album_params[:album][:band_id] = params[:band_id]
    # @album = Album.new(new_params)
    # @album = Album.new(new_params)
     @album = @band.albums.new(album_params)
    if @album.save!
---
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 6], ["title", "Back in Black "], ["year", 1980], ["live", true], ["created_at", "2021-03-03 00:56:04.414681"], ["updated_at", "2021-03-03 00:56:04.414681"]]

  def set_band
    @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]