w7d2/music/app/controllers/bands_controller.rb

  def destroy
    band = Band.find_by(id: params[:id])
    band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]