w7d2/music/app/controllers/tracks_controller.rb

  def create
    @track = @album.tracks.new(track_params)
    if @track.save!
---
INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "track_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 12], ["title", "jonenes"], ["ord", 3], ["lyrics", ""], ["track_type", "regular"], ["created_at", "2021-03-03 04:56:09.114047"], ["updated_at", "2021-03-03 04:56:09.114047"]]

  def update
    @track = Track.find_by(id: params[:id])
    if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["title", "jonenesssss"], ["lyrics", "  \"\""], ["updated_at", "2021-03-03 05:20:58.911802"], ["id", 1]]

  def edit
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_album
    @album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]