w7d2/music/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]
---
<div class="list-container">
<% @band.albums.each do |album| %>